; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image1 - mode
	thermograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	Star0 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon17)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation9)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star7)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star15)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Planet16)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Phenomenon14)
	(pointing satellite4 GroundStation8)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image1)
	(have_image Star15 image1)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph0)
	(have_image Star18 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
2. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 12
3. (turn_to satellite1 phenomenon17 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 12
4. (take_image satellite1 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 1 of 12
5. (turn_to satellite1 phenomenon14 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 12
6. (take_image satellite1 phenomenon14 instrument1 image1)
   added: (have_image phenomenon14 image1)
   goals met: 2 of 12
7. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 12
8. (take_image satellite1 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 12
9. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 12
10. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 12
11. (take_image satellite1 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 5 of 12
12. (turn_to satellite1 star15 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star15)
   goals met: 5 of 12
13. (take_image satellite1 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 6 of 12
14. (turn_to satellite1 star18 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star18)
   goals met: 6 of 12
15. (take_image satellite1 star18 instrument1 image1)
   added: (have_image star18 image1)
   goals met: 7 of 12
16. (turn_to satellite1 planet16 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 planet16)
   goals met: 8 of 12
17. (take_image satellite1 planet16 instrument1 image1)
   added: (have_image planet16 image1)
   goals met: 9 of 12
18. (turn_to satellite2 groundstation4 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 groundstation4)
   goals met: 10 of 12
19. (turn_to satellite3 phenomenon14 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon14)
   goals met: 11 of 12
20. (turn_to satellite4 groundstation8 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 groundstation8)
   goals met: 12 of 12
